insert into `astro_basic_info` (info_id, name, type, strengths, weaknesses, likes, dislikes) values
                                                                                           (1, '白羊座', 1, '勇敢, 热情, 自信, 果断', '冲动, 急躁, 好斗, 自我中心', '挑战, 冒险, 竞争, 运动', '延迟, 无聊, 被约束, 接受指令'),
                                                                                           (2, '金牛座', 2, '可靠, 有耐心, 诚实, 坚定', '顽固, 占有欲强, 贪婪, 缺乏变化', '园艺, 烹饪, 音乐, 豪华的事物', '突然的变化, 不安全感, 合成物, 被迫改变'),
                                                                                           (3, '双子座', 3, '聪明, 机智, 适应力强, 充满活力', '优柔寡断, 不可靠, 紧张, 表面化', '社交活动, 阅读, 旅行, 新奇事物', '单调, 孤独, 受到束缚, 无聊的活动'),
                                                                                           (4, '巨蟹座', 4, '富有同情心, 忠诚, 有责任心, 想象力丰富', '情绪化, 悲观, 多疑, 粘人', '家庭, 烹饪, 艺术, 水', '陌生人, 批评, 透露隐私, 对抗'),
                                                                                           (5, '狮子座', 5, '自信, 慷慨, 领导力强, 富有创造力', '自负, 固执, 好戏剧, 支配欲强', '舞台, 庆祝活动, 高级物品, 晒太阳', '被忽视, 面对困难现实, 不忠, 被控制'),
                                                                                           (6, '处女座', 6, '细致, 勤奋, 实用, 可靠', '吹毛求疵, 爱挑剔, 保守, 拖延', '阅读, 自然, 健康饮食, 清洁', '混乱, 粗心, 没有条理, 拖延'),
                                                                                           (7, '天秤座', 7, '社交能力强, 公正, 和平, 有美感', '优柔寡断, 逃避冲突, 自我怀疑, 被动', '艺术, 和谐, 时尚, 社交活动', '不公平, 冲突, 喧闹, 混乱'),
                                                                                           (8, '天蝎座', 8, '坚决, 勇敢, 热情, 忠诚', '占有欲强, 嫉妒, 秘密主义, 固执', '神秘, 权力, 真相, 强烈的情感', '背叛, 虚伪, 缺乏激情, 控制'),
                                                                                           (9, '射手座', 9, '乐观, 自由, 爱冒险, 诚实', '粗心, 不负责任, 过于理想化, 不耐烦', '旅行, 哲学, 户外活动, 冒险', '受限制, 常规, 冷漠, 约束'),
                                                                                           (10, '摩羯座', 10, '有责任心, 自律, 有雄心, 忠诚', '悲观, 固执, 缺乏灵活性, 保守', '传统, 音乐, 质量, 家庭', '浪费, 轻浮, 无效率, 不负责任'),
                                                                                           (11, '水瓶座', 11, '独立, 进步, 聪明, 友善', '固执, 反复无常, 疏远, 不切实际', '科技, 独立, 创新, 社交', '无聊, 限制, 一成不变, 被约束'),
                                                                                           (12, '双鱼座', 12, '同情心强, 直觉, 艺术性强, 无私', '过于敏感, 逃避现实, 没有主见, 自我牺牲', '艺术, 梦想, 静谧, 浪漫', '残酷, 无情, 争论, 忽视他人感受');
